In [2]:
import pandas as pd
import numpy as np
import pathlib

In [8]:
arr1 = np.arange(0,8).reshape((2,4))
arr2 = np.arange(100,108).reshape((2,4))
arr1, arr2

(array([[0, 1, 2, 3],
        [4, 5, 6, 7]]),
 array([[100, 101, 102, 103],
        [104, 105, 106, 107]]))

In [18]:
np.concat((arr1, arr2), axis=0)

array([[  0,   1,   2,   3],
       [  4,   5,   6,   7],
       [100, 101, 102, 103],
       [104, 105, 106, 107]])

In [13]:
csv_path = pathlib.Path(r'C:\Users\user\Desktop\div\data\world_population.csv')
df = pd.read_csv(csv_path)
df.head(3)

,Rank,CCA3,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
0,36,AFG,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52
1,138,ALB,Albania,Tirana,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04
2,34,DZA,Algeria,Algiers,Africa,44903225.0,43451666.0,39543154.0,35856344.0,30774621.0,25518074.0,18739378.0,13795915.0,2381741.0,18.8531,1.0164,0.56

In [23]:
df1 = df.iloc[:10, [2, 3]]
df2 = df.iloc[8:18, [2, 4]]
df2.head(2)

     Country      Continent
8  Argentina  South America
9    Armenia           Asia

In [24]:
df1.head(2)

       Country Capital
0  Afghanistan   Kabul
1      Albania  Tirana

In [ ]:
pd.merge(df1, df2, on='Country', how='right') # join

      Country       Capital      Continent
0   Argentina  Buenos Aires  South America
1     Armenia       Yerevan           Asia
2       Aruba           NaN  North America
3   Australia           NaN        Oceania
4     Austria           NaN         Europe
5  Azerbaijan           NaN           Asia
6     Bahamas           NaN  North America
7     Bahrain           NaN           Asia
8  Bangladesh           NaN           Asia
9    Barbados           NaN  North America

In [30]:
pd.concat([df1, df2], axis = 'columns')

                Country           Capital     Country      Continent
0           Afghanistan             Kabul         NaN            NaN
1               Albania            Tirana         NaN            NaN
2               Algeria           Algiers         NaN            NaN
3        American Samoa         Pago Pago         NaN            NaN
4               Andorra  Andorra la Vella         NaN            NaN
5                Angola            Luanda         NaN            NaN
6              Anguilla        The Valley         NaN            NaN
7   Antigua and Barbuda      Saint John’s         NaN            NaN
8             Argentina      Buenos Aires   Argentina  South America
9               Armenia           Yerevan     Armenia           Asia
10                  NaN               NaN       Aruba  North America
11                  NaN               NaN   Australia        Oceania
12                  NaN               NaN     Austria         Europe
13                  NaN               NaN  Azerbaijan           Asia
14                  NaN               NaN     Bahamas  North America
15                  NaN               NaN     Bahrain           Asia
16                  NaN               NaN  Bangladesh           Asia
17                  NaN               NaN    Barbados  North America

In [32]:
df.head(2)

,Rank,CCA3,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage
0,36,AFG,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52
1,138,ALB,Albania,Tirana,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04

In [52]:
# 41128771.0 * 1.0257 * 1.0257 * 1.0257 * 1.0257 * 1.0257 * 1.0257 * 1.0257 * 1.0257
41128771.0 * 1.0257**8

50385848.4828757

In [47]:
df.groupby(['Continent'], as_index=False)['2022 Population'].sum()
df.groupby(['Continent'])['2022 Population'].sum()
df.groupby(['Continent'])['Area (km²)'].mean()

Continent
Africa           5.378793e+05
Asia             6.427628e+05
Europe           4.602082e+05
North America    6.061044e+05
Oceania          3.702209e+05
South America    1.301303e+06
Name: Area (km²), dtype: float64

In [59]:
df['2030 Population'] = df.loc[:, '2022 Population'] * df.loc[:, 'Growth Rate']**8

def kategoriyalashdir(pop : float) -> str:
	if pop > 100e6:
		return 'large'
	elif pop > 25e5:
		return 'mid'
	else:
		return 'small'
    
df['2030_cat'] = df['2030 Population'].apply(kategoriyalashdir)
df.head(2)

,Rank,CCA3,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage,2030 Population,2030_cat
0,36,AFG,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52,5.038585e+07,mid
1,138,ALB,Albania,Tirana,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04,2.746004e+06,mid

In [63]:
df.groupby(['Continent', '2030_cat'])['Country'].count().to_frame().reset_index()

        Continent 2030_cat  Country
0          Africa    large        4
1          Africa      mid       41
2          Africa    small       12
3            Asia    large        8
4            Asia      mid       36
5            Asia    small        6
6          Europe    large        1
7          Europe      mid       28
8          Europe    small       21
9   North America    large        2
10  North America      mid       11
11  North America    small       27
12        Oceania      mid        3
13        Oceania    small       20
14  South America    large        1
15  South America      mid        9
16  South America    small        4

In [67]:
birth = pd.read_csv(r'C:\Users\user\Desktop\div\data\births.csv')
birth.head(4)

   year  month  day gender  births
0  1969      1  1.0      F    4046
1  1969      1  1.0      M    4440
2  1969      1  2.0      F    4454
3  1969      1  2.0      M    4548

In [71]:
birth[(birth['year'] == 2008) & (birth['month'] == 8)]

       year  month  day gender  births
15537  2008      8  NaN      F  182713
15538  2008      8  NaN      M  191315

In [75]:
il_ay_gun = birth.groupby(['year', 'month'], as_index=False)['day'].nunique(dropna=False)
il_ay_gun.groupby('year')['day'].sum()

year
1969    384
1970    384
1971    384
1972    384
1973    382
1974    383
1975    383
1976    383
1977    383
1978    382
1979    376
1980    375
1981    375
1982    376
1983    377
1984    377
1985    370
1986    370
1987    368
1988    371
1989     12
1990     12
1991     12
1992     12
1993     12
1994     12
1995     12
1996     12
1997     12
1998     12
1999     12
2000     12
2001     12
2002     12
2003     12
2004     12
2005     12
2006     12
2007     12
2008     12
Name: day, dtype: int64

In [77]:
df.head(2)

,Rank,CCA3,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage,2030 Population,2030_cat
0,36,AFG,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52,5.038585e+07,mid
1,138,ALB,Albania,Tirana,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04,2.746004e+06,mid

In [86]:
df.groupby('Continent')[
    ['2022 Population', '2030 Population']
    ].sum()

df.groupby('Continent').agg({
    '2022 Population' : 'sum', 
    '2030 Population' : 'sum', 
})

df.groupby('Continent').agg(
    pop_sum_2022 = ('2022 Population', 'sum'),
    pop_sum_2030 = ('2030 Population', 'sum'),
)

               pop_sum_2022  pop_sum_2030
Continent
Africa         1.425529e+09  1.688152e+09
Asia           4.720042e+09  4.957903e+09
Europe         7.377132e+08  7.386835e+08
North America  6.002961e+08  6.238142e+08
Oceania        4.502050e+07  4.968078e+07
South America  4.368166e+08  4.579544e+08

In [100]:
# df.groupby('Continent')['2022 Population'].sum()
# df.groupby('Continent')['2022 Population'].transform('sum')
df['cont_pop'] = df.groupby('Continent')['2022 Population'].transform('sum')
df.head(4)

,Rank,CCA3,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage,2030 Population,2030_cat,cont_pop
0,36,AFG,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52,5.038585e+07,mid,4.720042e+09
1,138,ALB,Albania,Tirana,Europe,2842321.0,2866849.0,2882481.0,2913399.0,3182021.0,3295066.0,2941651.0,2324731.0,28748.0,98.8702,0.9957,0.04,2.746004e+06,mid,7.377132e+08
2,34,DZA,Algeria,Algiers,Africa,44903225.0,43451666.0,39543154.0,35856344.0,30774621.0,25518074.0,18739378.0,13795915.0,2381741.0,18.8531,1.0164,0.56,5.114401e+07,mid,1.425529e+09
3,213,ASM,American Samoa,Pago Pago,Oceania,44273.0,46189.0,51368.0,54849.0,58230.0,47818.0,32886.0,27075.0,199.0,222.4774,0.9831,0.00,3.862963e+04,small,4.502050e+07

In [101]:
def boyuk_qiteleri_saxla(balaca_df):
    return balaca_df['2022 Population'].sum() > 1e9

df.groupby('Continent').filter(boyuk_qiteleri_saxla)

,Rank,CCA3,Country,Capital,Continent,2022 Population,2020 Population,2015 Population,2010 Population,2000 Population,1990 Population,1980 Population,1970 Population,Area (km²),Density (per km²),Growth Rate,World Population Percentage,2030 Population,2030_cat,cont_pop
0,36,AFG,Afghanistan,Kabul,Asia,41128771.0,38972230.0,33753499.0,28189672.0,19542982.0,10694796.0,12486631.0,10752971.0,652230.0,63.0587,1.0257,0.52,5.038585e+07,mid,4.720042e+09
2,34,DZA,Algeria,Algiers,Africa,44903225.0,43451666.0,39543154.0,35856344.0,30774621.0,25518074.0,18739378.0,13795915.0,2381741.0,18.8531,1.0164,0.56,5.114401e+07,mid,1.425529e+09
5,42,AGO,Angola,Luanda,Africa,35588987.0,33428485.0,28127721.0,23364185.0,16394062.0,11828638.0,8330047.0,6029700.0,1246700.0,28.5466,1.0315,0.45,4.561099e+07,mid,1.425529e+09
9,140,ARM,Armenia,Yerevan,Asia,2780469.0,2805608.0,2878595.0,2946293.0,3168523.0,3556539.0,3135123.0,2534377.0,29743.0,93.4831,0.9962,0.03,2.697058e+06,mid,4.720042e+09
13,91,AZE,Azerbaijan,Baku,Asia,10358074.0,NaN,9863480.0,9237202.0,8190337.0,7427836.0,6383060.0,5425317.0,86600.0,119.6082,1.0044,0.13,1.072834e+07,mid,4.720042e+09
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
228,16,VNM,Vietnam,Hanoi,Asia,98186856.0,96648685.0,92191398.0,87411012.0,79001142.0,66912613.0,52968270.0,41928849.0,331212.0,296.4472,1.0074,1.23,1.041523e+08,large,4.720042e+09
230,172,ESH,Western Sahara,El Aaiún,Africa,575986.0,556048.0,491824.0,413296.0,270375.0,178529.0,116775.0,76371.0,266000.0,2.1654,1.0184,0.01,6.664369e+05,small,1.425529e+09
231,46,YEM,Yemen,Sanaa,Asia,33696614.0,32284046.0,28516545.0,24743946.0,18628700.0,13375121.0,9204938.0,6843607.0,527968.0,63.8232,1.0217,0.42,4.001045e+07,mid,4.720042e+09
232,63,ZMB,Zambia,Lusaka,Africa,20017675.0,18927715.0,NaN,13792086.0,9891136.0,7686401.0,5720438.0,4281671.0,752612.0,26.5976,1.0280,0.25,2.496655e+07,mid,1.425529e+09
233,74,ZWE,Zimbabwe,Harare,Africa,16320537.0,15669666.0,14154937.0,12839771.0,11834676.0,10113893.0,7049926.0,5202918.0,390757.0,41.7665,1.0204,0.20,1.918218e+07,mid,1.425529e+09

In [99]:
df['2022 Population'] / df['cont_pop'] * 100

0      0.871365
1      0.385288
2      3.149934
3      0.098340
4      0.010820
         ...
229    0.025704
230    0.040405
231    0.713905
232    1.404228
233    1.144876
Length: 234, dtype: float64

In [94]:
10e6 / 4.720042e+09 * 100

0.21186252156230814

In [ ]:
# %pip install matplotlib seaborn

In [102]:
import seaborn as sns

In [104]:
titanic = sns.load_dataset('titanic')
titanic.head(2)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False

In [117]:
df_final = titanic.groupby(['class', 'sex'], as_index=False)[
    'survived'].mean()
df_final.to_excel('titanic-pivot.xlsx')
df_final

C:\Users\user\AppData\Local\Temp\ipykernel_16728\3918048377.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df_final = titanic.groupby(['class', 'sex'], as_index=False)[

    class     sex  survived
0   First  female  0.968085
1   First    male  0.368852
2  Second  female  0.921053
3  Second    male  0.157407
4   Third  female  0.500000
5   Third    male  0.135447

In [113]:
titanic.groupby(['class', 'sex'], )['survived'].mean().unstack()

C:\Users\user\AppData\Local\Temp\ipykernel_16728\1298138992.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  titanic.groupby(['class', 'sex'], )['survived'].mean().unstack()

sex       female      male
class
First   0.968085  0.368852
Second  0.921053  0.157407
Third   0.500000  0.135447

In [118]:
titanic.pivot_table(
    values='survived',
    index='class',
    columns='sex',
    aggfunc='mean',
    margins=True
)

C:\Users\user\AppData\Local\Temp\ipykernel_16728\177744894.py:1: FutureWarning: The default value of observed=False is deprecated and will change to observed=True in a future version of pandas. Specify observed=False to silence this warning and retain the current behavior
  titanic.pivot_table(

sex       female      male       All
class
First   0.968085  0.368852  0.629630
Second  0.921053  0.157407  0.472826
Third   0.500000  0.135447  0.242363
All     0.742038  0.188908  0.383838

In [ ]:
titanic.groupby(
    ['class', 'sex'], 
    # as_index=False
)['survived'].mean()